onegray/nuttx/arch/arm/src/stm32wb/hardware/stm32wbx5xx_rcc.h
#define RCC_PLLCFG_PLLSRC_SHIFT     (0)       /* Bit 0-1: Main PLL and audio PLLSAI1 entry clock source */
#define RCC_PLLCFG_PLLSRC_MASK      (0x3 << RCC_PLLCFG_PLLSRC_SHIFT)
#  define RCC_PLLCFG_PLLSRC_NONE    (0x0 << RCC_PLLCFG_PLLSRC_SHIFT) /* 00: No clock sent to PLLs */
#  define RCC_PLLCFG_PLLSRC_MSI     (0x1 << RCC_PLLCFG_PLLSRC_SHIFT) /* 01: MSI selected as PLLs source */
#  define RCC_PLLCFG_PLLSRC_HSI16   (0x2 << RCC_PLLCFG_PLLSRC_SHIFT) /* 10: HSI16 selected as PLLs source */
#  define RCC_PLLCFG_PLLSRC_HSE     (0x3 << RCC_PLLCFG_PLLSRC_SHIFT) /* 11: HSE selected as PLLs source */

#define RCC_PLLCFG_PLLM_SHIFT       (4)       /* Bits 4-6: Main PLL and audio PLLSAI1 divider */
#define RCC_PLLCFG_PLLM_MASK        (0x07 << RCC_PLLCFG_PLLM_SHIFT)
#  define RCC_PLLCFG_PLLM(n)        ((n-1) << RCC_PLLCFG_PLLM_SHIFT) /* n = 1..8 */

#define RCC_PLLCFG_PLLN_SHIFT       (8)       /* Bits 8-14: Main PLL (PLL) VCO multiplier */
#define RCC_PLLCFG_PLLN_MASK        (0x7f << RCC_PLLCFG_PLLN_SHIFT)
#  define RCC_PLLCFG_PLLN(n)        ((n) << RCC_PLLCFG_PLLN_SHIFT) /* n = 6..127 */

#define RCC_PLLCFG_PLLPEN           (1 << 16) /* Bit 16: Main PLL PLLPCLK output enable */

#define RCC_PLLCFG_PLLP_SHIFT       (17)      /* Bit 17-21: Main PLL div factor for PLLPCLK */
#define RCC_PLLCFG_PLLP_MASK        (0x1f << RCC_PLLCFG_PLLP_SHIFT)
#  define RCC_PLLCFG_PLLP(n)        ((n-1) << RCC_PLLCFG_PLLP_SHIFT) /* n = 2..32 */

#define RCC_PLLCFG_PLLQEN           (1 << 24) /* Bit 24: Main PLL PLLQCLK output enable */

#define RCC_PLLCFG_PLLQ_SHIFT       (25)      /* Bits 25-27: Main PLL division factor for PLLQCLK */
#define RCC_PLLCFG_PLLQ_MASK        (0x3 << RCC_PLLCFG_PLLQ_SHIFT)
#  define RCC_PLLCFG_PLLQ(n)        ((n-1) << RCC_PLLCFG_PLLQ_SHIFT) /* n = 2..8 */

#define RCC_PLLCFG_PLLREN           (1 << 28) /* Bit 28: Main PLL PLLRCLK output enable */

#define RCC_PLLCFG_PLLR_SHIFT       (29)      /* Bits 29-31: Main PLL division factor for PLLRCLK */
#define RCC_PLLCFG_PLLR_MASK        (0x3 << RCC_PLLCFG_PLLR_SHIFT)
#  define RCC_PLLCFG_PLLR(n)        ((n-1) << RCC_PLLCFG_PLLR_SHIFT) /* n = 2..8 */

#define RCC_PLLCFG_RESET            (0x22040100) /* PLLCFG reset value */

/* PLLSAI1 Configuration register */

#define RCC_PLLSAI1CFG_PLLN_SHIFT   (8)       /* Bits 8-14: SAI1 PLL (PLLSAI1) VCO multiplier */
#define RCC_PLLSAI1CFG_PLLN_MASK    (0x7f << RCC_PLLSAI1CFG_PLLN_SHIFT)
#  define RCC_PLLSAI1CFG_PLLN(n)    ((n) << RCC_PLLSAI1CFG_PLLN_SHIFT) /* n = 4..86 */

#define RCC_PLLSAI1CFG_PLLPEN       (1 << 16) /* Bit 16: SAI1 PLL PLLSAI1CLK output enable */

#define RCC_PLLSAI1CFG_PLLP_SHIFT   (17)      /* Bit 17-21: Main PLL div factor for PLLSAI1CLK */
#define RCC_PLLSAI1CFG_PLLP_MASK    (0x1f << RCC_PLLSAI1CFG_PLLP_SHIFT)
#  define RCC_PLLSAI1CFG_PLLP(n)    ((n-1) << RCC_PLLSAI1CFG_PLLP_SHIFT) /* n = 2..32 */

#define RCC_PLLSAI1CFG_PLLQEN       (1 << 24) /* Bit 24: PLLSAI1QCLK output enable */

#define RCC_PLLSAI1CFG_PLLQ_SHIFT   (25)      /* Bits 25-27: PLLSAI1 division factor for PLLSAI1QCLK */
#define RCC_PLLSAI1CFG_PLLQ_MASK    (0x3 << RCC_PLLSAI1CFG_PLLQ_SHIFT)
#  define RCC_PLLSAI1CFG_PLLQ(n)    ((n-1) << RCC_PLLSAI1CFG_PLLQ_SHIFT) /* n = 2..8 */

#define RCC_PLLSAI1CFG_PLLREN       (1 << 28) /* Bit 28: SAI1 PLL PLLSAI1RCLK output enable */

#define RCC_PLLSAI1CFG_PLLR_SHIFT   (29)      /* Bits 29-31: PLLSAI1 division factor for PLLSAI1RCLK */
#define RCC_PLLSAI1CFG_PLLR_MASK    (0x3 << RCC_PLLSAI1CFG_PLLR_SHIFT)
#  define RCC_PLLSAI1CFG_PLLR(n)    ((n-1) << RCC_PLLSAI1CFG_PLLR_SHIFT) /* n = 2..8 */

/* Clock interrupt enable register */

#define RCC_CIER_LSI1RDYIE          (1 << 0)  /* Bit 0: LSI1 Ready Interrupt Enable */
#define RCC_CIER_LSERDYIE           (1 << 1)  /* Bit 1: LSE Ready Interrupt Enable */
#define RCC_CIER_MSIRDYIE           (1 << 2)  /* Bit 2: MSI Ready Interrupt Enable */
#define RCC_CIER_HSI16RDYIE         (1 << 3)  /* Bit 3: HSI16 Ready Interrupt Enable */
#define RCC_CIER_HSERDYIE           (1 << 4)  /* Bit 4: HSE Ready Interrupt Enable */
#define RCC_CIER_PLLRDYIE           (1 << 5)  /* Bit 5: PLL Ready Interrupt Enable */
#define RCC_CIER_PLLSAI1RDYIE       (1 << 6)  /* Bit 6: PLLSAI1 Ready Interrupt enable */
#define RCC_CIER_LSECSSIE           (1 << 9)  /* Bit 9: LSE Clock Security System Interrupt Enable */
#define RCC_CIER_HSI48RDYIE         (1 << 10) /* Bit 10: HSI48 Ready Interrupt Enable */
#define RCC_CIER_LSI2RDYIE          (1 << 11) /* Bit 11: LSI2 Ready Interrupt Enable */

/* Clock interrupt flag register */

#define RCC_CIFR_LSI1RDYIF          (1 << 0)  /* Bit 0:  LSI1 Ready Interrupt Flag */
#define RCC_CIFR_LSERDYIF           (1 << 1)  /* Bit 1:  LSE Ready Interrupt Flag */
#define RCC_CIFR_MSIRDYIF           (1 << 2)  /* Bit 2:  MSI Ready Interrupt Flag */
#define RCC_CIFR_HSI16RDYIF         (1 << 3)  /* Bit 3:  HSI16 Ready Interrupt Flag */
#define RCC_CIFR_HSERDYIF           (1 << 4)  /* Bit 4:  HSE Ready Interrupt Flag */
#define RCC_CIFR_PLLRDYIF           (1 << 5)  /* Bit 5:  PLL Ready Interrupt Flag */
#define RCC_CIFR_PLLSAI1RDYIF       (1 << 6)  /* Bit 6:  PLLSAI1 Ready Interrupt Flag */
#define RCC_CIFR_CSSF               (1 << 8)  /* Bit 8:  Clock Security System Interrupt Flag */
#define RCC_CIFR_LSECSSIF           (1 << 9)  /* Bit 9:  LSE Clock Security System Interrupt Flag */
#define RCC_CIFR_HSI48RDYIF         (1 << 10) /* Bit 10: HSI48 Ready Interrupt Flag */
#define RCC_CIFR_LSI2RDYIF          (1 << 11) /* Bit 11: LSI2 Ready Interrupt Flag */

/* Clock interrupt clear register */

#define RCC_CICR_LSI1RDYIC          (1 << 0)  /* Bit 0:  LSI1 Ready Interrupt Clear */
#define RCC_CICR_LSERDYIC           (1 << 1)  /* Bit 1:  LSE Ready Interrupt Clear */
#define RCC_CICR_MSIRDYIC           (1 << 2)  /* Bit 2:  MSI Ready Interrupt Clear */
#define RCC_CICR_HSI16RDYIC         (1 << 3)  /* Bit 3:  HSI16 Ready Interrupt Clear */
#define RCC_CICR_HSERDYIC           (1 << 4)  /* Bit 4:  HSE Ready Interrupt Clear */
#define RCC_CICR_PLLRDYIC           (1 << 5)  /* Bit 5:  PLL Ready Interrupt Clear */
#define RCC_CICR_PLLSAI1RDYIC       (1 << 6)  /* Bit 6:  PLLSAI1 Ready Interrupt Clear */
#define RCC_CICR_CSSC               (1 << 8)  /* Bit 8:  Clock Security System Interrupt Clear */
#define RCC_CICR_LSECSSIC           (1 << 9)  /* Bit 9:  LSE Clock Security System Interrupt Clear */
#define RCC_CICR_HSI48RDYIC         (1 << 10) /* Bit 10: HSI48 Oscillator Ready Interrupt Clear */
#define RCC_CICR_LSI2RDYIC          (1 << 11) /* Bit 11: LSI2 Ready Interrupt Clear */

/* SMPS step-down converter control register */

#define RCC_SMPS_SMPSSEL_SHIFT      (0)       /* Bits 0-1: SMPS Clock Selection  */
#define RCC_SMPS_SMPSSEL_MASK       (0x3 << RCC_SMPS_SMPSSEL_SHIFT)
#  define RCC_SMPS_SMPSSEL_HSI16    (0x0 << RCC_SMPS_SMPSSEL_SHIFT) /* 00: HSI16 selected as SMPS clock */
#  define RCC_SMPS_SMPSSEL_MSI      (0x1 << RCC_SMPS_SMPSSEL_SHIFT) /* 01: MSI selected as SMPS clock */
#  define RCC_SMPS_SMPSSEL_HSE      (0x2 << RCC_SMPS_SMPSSEL_SHIFT) /* 10: HSE selected as SMPS clock */
#  define RCC_SMPS_SMPSSEL_NONE     (0x3 << RCC_SMPS_SMPSSEL_SHIFT) /* 11: no clock is used */

#define RCC_SMPS_SMPSDIV_SHIFT      (4)       /* Bits 4-5: SMPS Clock Division factor */
#define RCC_SMPS_SMPSDIV_MASK       (0x3 << RCC_SMPS_SMPSDIV_SHIFT)
#  define RCC_SMPS_SMPSDIVd1        (0x0 << RCC_SMPS_SMPSDIV_SHIFT) /* 00: Selected clock not divided */
#  define RCC_SMPS_SMPSDIVd2        (0x1 << RCC_SMPS_SMPSDIV_SHIFT) /* 01: Selected clock divided by 2 */

#define RCC_SMPS_SMPSSWS_SHIFT      (8)       /* Bits 8-9: SMPS Clock Switch Status */
#define RCC_SMPS_SMPSSWS_MASK       (0x3 << RCC_SMPS_SMPSSWS_SHIFT)
#  define RCC_SMPS_SMPSSWS_HSI16    (0x0 << RCC_SMPS_SMPSSWS_SHIFT) /* 00: HSI16 oscillator used as SMPS clock */
#  define RCC_SMPS_SMPSSWS_MSI      (0x1 << RCC_SMPS_SMPSSWS_SHIFT) /* 01: MSI oscillator used as SMPS clock */
#  define RCC_SMPS_SMPSSWS_HSE      (0x2 << RCC_SMPS_SMPSSWS_SHIFT) /* 10: HSE oscillator used as SMPS clock */
#  define RCC_SMPS_SMPSSWS_NONE     (0x3 << RCC_SMPS_SMPSSWS_SHIFT) /* 11: no clock is used */

/* AHB1 peripheral reset register */

#define RCC_AHB1RSTR_DMA1RST        (1 << 0)  /* Bit 0:  DMA1 reset */
#define RCC_AHB1RSTR_DMA2RST        (1 << 1)  /* Bit 1:  DMA2 reset */
#define RCC_AHB1RSTR_DMAMUX1RST     (1 << 2)  /* Bit 2:  DMAMUX1 reset */
#define RCC_AHB1RSTR_FLASHRST       (1 << 8)  /* Bit 8:  Flash memory interface reset */
#define RCC_AHB1RSTR_CRCRST         (1 << 12) /* Bit 12: CRC reset */
#define RCC_AHB1RSTR_TSCRST         (1 << 16) /* Bit 16: Touch Sensing Controller reset */

/* AHB2 peripheral reset register */

#define RCC_AHB2RSTR_GPIORST(n)     (1 << (n))
#define RCC_AHB2RSTR_GPIOARST       (1 << 0)  /* Bit 0:  IO port A reset */
#define RCC_AHB2RSTR_GPIOBRST       (1 << 1)  /* Bit 1:  IO port B reset */
#define RCC_AHB2RSTR_GPIOCRST       (1 << 2)  /* Bit 2:  IO port C reset */
#define RCC_AHB2RSTR_GPIODRST       (1 << 3)  /* Bit 3:  IO port D reset */
#define RCC_AHB2RSTR_GPIOERST       (1 << 4)  /* Bit 4:  IO port E reset */
#define RCC_AHB2RSTR_GPIOHRST       (1 << 7)  /* Bit 7:  IO port H reset */
#define RCC_AHB2RSTR_ADCRST         (1 << 13) /* Bit 13: ADC reset */
#define RCC_AHB2RSTR_AESRST         (1 << 16) /* Bit 16: AES reset */

/* AHB3 and AHB4 peripheral reset register */

#define RCC_AHB3RSTR_QSPIRST        (1 << 8)  /* Bit 8:  QSPI reset */
#define RCC_AHB3RSTR_PKARST         (1 << 16) /* Bit 16: PKA reset */
#define RCC_AHB3RSTR_AES2IRST       (1 << 17) /* Bit 17: AES2 reset */
#define RCC_AHB3RSTR_RNGRST         (1 << 18) /* Bit 18: RNG reset */
#define RCC_AHB3RSTR_HSEMRST        (1 << 19) /* Bit 19: HSEM reset */
#define RCC_AHB3RSTR_IPCCRST        (1 << 20) /* Bit 20: IPCC reset */
#define RCC_AHB3RSTR_FLASHRST       (1 << 25) /* Bit 16: FLASH reset */

/* APB1 Peripheral reset register 1 */

#define RCC_APB1RSTR1_TIM2RST       (1 << 0)  /* Bit 0:  TIM2 reset */
#define RCC_APB1RSTR1_LCDRST        (1 << 9)  /* Bit 9:  LCD reset */
#define RCC_APB1RSTR1_SPI2RST       (1 << 14) /* Bit 14: SPI2 reset */
#define RCC_APB1RSTR1_I2C1RST       (1 << 21) /* Bit 21: I2C1 reset */
#define RCC_APB1RSTR1_I2C3RST       (1 << 23) /* Bit 23: I2C3 reset */
#define RCC_APB1RSTR1_CRSRST        (1 << 24) /* Bit 24: CRS reset */
#define RCC_APB1RSTR1_USBRST        (1 << 26) /* Bit 26: USB reset */
#define RCC_APB1RSTR1_LPTIM1RST     (1 << 31) /* Bit 31: LPTIM1 reset */

/* APB1 Peripheral reset register 2 */

#define RCC_APB1RSTR2_LPUART1RST    (1 << 0)  /* Bit 0: LPUART1 reset */
#define RCC_APB1RSTR2_LPTIM2RST     (1 << 5)  /* Bit 5: LPTIM2 reset */

/* APB2 Peripheral reset register */

