onegray/nuttx/arch/arm/src/stm32wb/hardware/stm32wbx5xx_rcc.h
#define RCC_APB2RSTR_TIM1RST        (1 << 11) /* Bit 11: TIM1 reset */
#define RCC_APB2RSTR_SPI1RST        (1 << 12) /* Bit 12: SPI1 reset */
#define RCC_APB2RSTR_USART1RST      (1 << 14) /* Bit 14: USART1 reset */
#define RCC_APB2RSTR_TIM16RST       (1 << 17) /* Bit 17: TIM16 reset */
#define RCC_APB2RSTR_TIM17RST       (1 << 18) /* Bit 18: TIM17 reset */
#define RCC_APB2RSTR_SAI1RST        (1 << 21) /* Bit 21: SAI1 reset */

/* APB3 Peripheral reset register */

#define RCC_APB3RSTR_RFRST          (1 << 0)  /* Bit 0: Radio system BLE and 802.15.4 reset */

/* AHB1 Peripheral Clock enable register */

#define RCC_AHB1ENR_DMA1EN          (1 << 0)  /* Bit 0:  DMA1 Enable */
#define RCC_AHB1ENR_DMA2EN          (1 << 1)  /* Bit 1:  DMA2 Enable */
#define RCC_AHB1ENR_DMAMUX1EN       (1 << 2)  /* Bit 2:  DMAMUX1 Enable */
#define RCC_AHB1ENR_CRCEN           (1 << 12) /* Bit 12: CRC Enable */
#define RCC_AHB1ENR_TSCEN           (1 << 16) /* Bit 16: Touch Sensing Controller Enable */

/* AHB2 Peripheral Clock enable register */

#define RCC_AHB2ENR_GPIOEN(n)       (1 << (n))
#define RCC_AHB2ENR_GPIOAEN         (1 << 0)  /* Bit 0:  IO port A Enable */
#define RCC_AHB2ENR_GPIOBEN         (1 << 1)  /* Bit 1:  IO port B Enable */
#define RCC_AHB2ENR_GPIOCEN         (1 << 2)  /* Bit 2:  IO port C Enable */
#define RCC_AHB2ENR_GPIODEN         (1 << 3)  /* Bit 3:  IO port D Enable */
#define RCC_AHB2ENR_GPIOEEN         (1 << 4)  /* Bit 4:  IO port E Enable */
#define RCC_AHB2ENR_GPIOHEN         (1 << 7)  /* Bit 7:  IO port H Enable */
#define RCC_AHB2ENR_ADCEN           (1 << 13) /* Bit 13: ADC interface Enable */
#define RCC_AHB2ENR_AES1EN          (1 << 16) /* Bit 16: AES1 Enable */

/* AHB3 and AHB4 Peripheral Clock enable register */

#define RCC_AHB3ENR_QSPIEN          (1 << 8)  /* Bit 8:  QSPI Enable */
#define RCC_AHB3ENR_PKAEN           (1 << 16) /* Bit 16: PKA Enable */
#define RCC_AHB3ENR_AES2EN          (1 << 17) /* Bit 17: AES2 Enable */
#define RCC_AHB3ENR_RNGEN           (1 << 18) /* Bit 18: RNG Enable */
#define RCC_AHB3ENR_HSEMEN          (1 << 19) /* Bit 19: HSEM Enable */
#define RCC_AHB3ENR_IPCCEN          (1 << 20) /* Bit 20: IPCC Enable */
#define RCC_AHB3ENR_FLASHEN         (1 << 25) /* Bit 25: FLASH Enable */

/* APB1 Peripheral Clock enable register 1 */

#define RCC_APB1ENR1_TIM2EN         (1 << 0)  /* Bit 0:  TIM2 enable */
#define RCC_APB1ENR1_LCDEN          (1 << 9)  /* Bit 9:  LCD enable */
#define RCC_APB1ENR1_RTCAPBEN       (1 << 10) /* Bit 10: RTC APB clock enable */
#define RCC_APB1ENR1_WWDGEN         (1 << 11) /* Bit 11: Windowed Watchdog enable */
#define RCC_APB1ENR1_SPI2EN         (1 << 14) /* Bit 14: SPI2 enable */
#define RCC_APB1ENR1_I2C1EN         (1 << 21) /* Bit 21: I2C1 enable */
#define RCC_APB1ENR1_I2C3EN         (1 << 23) /* Bit 23: I2C3 enable */
#define RCC_APB1ENR1_CRSEN          (1 << 24) /* Bit 24: CRSEN enable */
#define RCC_APB1ENR1_USBEN          (1 << 26) /* Bit 26: USB enable */
#define RCC_APB1ENR1_LPTIM1EN       (1 << 31) /* Bit 31: LPTIM1 enable */

/* APB1 Peripheral Clock enable register 2 */

#define RCC_APB1ENR2_LPUART1EN      (1 << 0)  /* Bit 0:  LPUART1 enable */
#define RCC_APB1ENR2_LPTIM2EN       (1 << 5)  /* Bit 5:  LPTIM2 enable */

/* APB2 Peripheral Clock enable register */

#define RCC_APB2ENR_TIM1EN          (1 << 11) /* Bit 11: TIM1 enable */
#define RCC_APB2ENR_SPI1EN          (1 << 12) /* Bit 12: SPI1 enable */
#define RCC_APB2ENR_USART1EN        (1 << 14) /* Bit 14: USART1 enable */
#define RCC_APB2ENR_TIM16EN         (1 << 17) /* Bit 17: TIM16 enable */
#define RCC_APB2ENR_TIM17EN         (1 << 18) /* Bit 18: TIM17 enable */
#define RCC_APB2ENR_SAI1EN          (1 << 21) /* Bit 21: SAI1 enable */

/* AHB1 peripheral clock enable in sleep and stop modes register */

#define RCC_AHB1SMENR_DMA1LPSMEN    (1 << 0)  /* Bit 0:  DMA1 enable in sleep and stop modes */
#define RCC_AHB1SMENR_DMA2LPSMEN    (1 << 1)  /* Bit 1:  DMA2 enable in sleep and stop modes */
#define RCC_AHB1SMENR_DMAMUX1SMEN   (1 << 2)  /* Bit 2:  DMAMUX1 clock enable in sleep and stop modes */
#define RCC_AHB1SMENR_SRAM1SMEN     (1 << 9)  /* Bit 9:  SRAM1 enable in sleep and stop modes */
#define RCC_AHB1SMENR_CRCSMEN       (1 << 12) /* Bit 12: CRC enable in sleep and stop modes */
#define RCC_AHB1SMENR_TSCSMEN       (1 << 16) /* Bit 16: TSC enable in sleep and stop modes */

/* AHB2 peripheral clock enable in sleep and stop modes register */

#define RCC_AHB2SMENR_GPIOASMEN     (1 << 0)  /* Bit 0:  IO port A enable in sleep and stop modes */
#define RCC_AHB2SMENR_GPIOBSMEN     (1 << 1)  /* Bit 1:  IO port B enable in sleep and stop modes */
#define RCC_AHB2SMENR_GPIOCSMEN     (1 << 2)  /* Bit 2:  IO port C enable in sleep and stop modes */
#define RCC_AHB2SMENR_GPIODSMEN     (1 << 3)  /* Bit 3:  IO port D enable in sleep and stop modes */
#define RCC_AHB2SMENR_GPIOESMEN     (1 << 4)  /* Bit 4:  IO port E enable in sleep and stop modes */
#define RCC_AHB2SMENR_GPIOHSMEN     (1 << 7)  /* Bit 7:  IO port H enable in sleep and stop modes */
#define RCC_AHB2SMENR_ADCSMEN       (1 << 13) /* Bit 13: ADC enable in sleep and stop modes */
#define RCC_AHB2SMENR_AES1SMEN      (1 << 16) /* Bit 16: AES1 enable in sleep and stop modes */

/* AHB3 and AHB4 peripheral clock enable in sleep and stop modes register */

#define RCC_AHB3SMENR_QSPISMEN      (1 << 8)  /* Bit 8:  QSPI enable in sleep and stop modes */
#define RCC_AHB3SMENR_PKASMEN       (1 << 16) /* Bit 16: PKA enable in sleep and stop modes */
#define RCC_AHB3SMENR_AES2SMEN      (1 << 17) /* Bit 17: AES2 enable in sleep and stop modes */
#define RCC_AHB3SMENR_RNGSMEN       (1 << 18) /* Bit 18: RNG enable in sleep and stop modes */
#define RCC_AHB3SMENR_SRAM2SMEN     (1 << 24) /* Bit 24: SRAM2x enable in sleep and stop modes */
#define RCC_AHB3SMENR_FLASHSMEN     (1 << 25) /* Bit 25: FLASH memory enable in sleep and stop modes */

/* APB1 peripheral clock enable in sleep and stop modes register 1 */

#define RCC_APB1SMENR1_TIM2SMEN     (1 << 0)  /* Bit 0:  TIM2 enable in sleep and stop modes */
#define RCC_APB1SMENR1_LCDSMEN      (9 << 0)  /* Bit 9:  LCD enable in sleep and stop modes */
#define RCC_APB1SMENR1_RTCAPBSMEN   (1 << 10) /* Bit 10: RTC APB clock enable in sleep and stop modes */
#define RCC_APB1SMENR1_WWDGSMEN     (1 << 11) /* Bit 11: Windowed Watchdog enable in sleep and stop modes */
#define RCC_APB1SMENR1_SPI2SMEN     (1 << 14) /* Bit 14: SPI2 enable in sleep and stop modes */
#define RCC_APB1SMENR1_I2C1SMEN     (1 << 21) /* Bit 21: I2C1 enable in sleep and stop modes */
#define RCC_APB1SMENR1_I2C3SMEN     (1 << 23) /* Bit 23: I2C3 enable in sleep and stop modes */
#define RCC_APB1SMENR1_CRSSMEN      (1 << 24) /* Bit 24: CRS enable in sleep and stop modes */
#define RCC_APB1SMENR1_USBSMEN      (1 << 26) /* Bit 26: USB enable in sleep and stop modes */
#define RCC_APB1SMENR1_LPTIM1SMEN   (1 << 31) /* Bit 31: LPTIM1 enable in sleep and stop modes */

/* APB1 peripheral clock enable in sleep and stop modes register 2 */

#define RCC_APB1SMENR2_LPUART1SMEN  (1 << 0)  /* Bit 0:  LPUART1 enable in sleep and stop modes */
#define RCC_APB1SMENR2_LPTIM2SMEN   (1 << 5)  /* Bit 5:  LPTIM2 enable in sleep and stop modes */

/* APB2 peripheral clock enable in sleep and stop modes register */

