onegray/nuttx/arch/arm/src/stm32wb/hardware/stm32wbx5xx_rcc.h
#define RCC_APB2SMENR_TIM1SMEN      (1 << 11) /* Bit 11: TIM1 enable in sleep and stop modes */
#define RCC_APB2SMENR_SPI1SMEN      (1 << 12) /* Bit 12: SPI1 enable in sleep and stop modes */
#define RCC_APB2SMENR_USART1SMEN    (1 << 14) /* Bit 14: USART1 enable in sleep and stop modes */
#define RCC_APB2SMENR_TIM16SMEN     (1 << 17) /* Bit 17: TIM16 enable in sleep and stop modes */
#define RCC_APB2SMENR_TIM17SMEN     (1 << 18) /* Bit 18: TIM17 enable in sleep and stop modes */
#define RCC_APB2SMENR_SAI1SMEN      (1 << 21) /* Bit 21: SAI1 enable in sleep and stop modes */

/* Peripheral Independent Clock Configuration register */

#define RCC_CCIPR_USART1SEL_SHIFT     (0)     /* Bits 0-1: USART1 clock source selection */
#define RCC_CCIPR_USART1SEL_MASK      (0x3 << RCC_CCIPR_USART1SEL_SHIFT)
#  define RCC_CCIPR_USART1SEL_PCLK    (0x0 << RCC_CCIPR_USART1SEL_SHIFT)  /* 00: PCLK selected */
#  define RCC_CCIPR_USART1SEL_SYSCLK  (0x1 << RCC_CCIPR_USART1SEL_SHIFT)  /* 01: System clock selected */
#  define RCC_CCIPR_USART1SEL_HSI16   (0x2 << RCC_CCIPR_USART1SEL_SHIFT)  /* 10: HSI16 clock selected */
#  define RCC_CCIPR_USART1SEL_LSE     (0x3 << RCC_CCIPR_USART1SEL_SHIFT)  /* 11: LSE clock selected */

#define RCC_CCIPR_LPUART1SEL_SHIFT    (10)    /* Bits 10-11: LPUART1 clock source selection */
#define RCC_CCIPR_LPUART1SEL_MASK     (0x3 << RCC_CCIPR_LPUART1SEL_SHIFT)
#  define RCC_CCIPR_LPUART1SEL_PCLK   (0x0 << RCC_CCIPR_LPUART1SEL_SHIFT) /* 00: PCLK selected */
#  define RCC_CCIPR_LPUART1SEL_SYSCLK (0x1 << RCC_CCIPR_LPUART1SEL_SHIFT) /* 01: System clock selected */
#  define RCC_CCIPR_LPUART1SEL_HSI16  (0x2 << RCC_CCIPR_LPUART1SEL_SHIFT) /* 10: HSI16 clock selected */
#  define RCC_CCIPR_LPUART1SEL_LSE    (0x3 << RCC_CCIPR_LPUART1SEL_SHIFT) /* 11: LSE clock selected */

#define RCC_CCIPR_I2C1SEL_SHIFT       (12)    /* Bits 12-13: I2C1 clock source selection */
#define RCC_CCIPR_I2C1SEL_MASK        (0x3 << RCC_CCIPR_I2C1SEL_SHIFT)
#  define RCC_CCIPR_I2C1SEL_PCLK      (0x0 << RCC_CCIPR_I2C1SEL_SHIFT)    /* 00: PCLK selected */
#  define RCC_CCIPR_I2C1SEL_SYSCLK    (0x1 << RCC_CCIPR_I2C1SEL_SHIFT)    /* 01: System clock selected */
#  define RCC_CCIPR_I2C1SEL_HSI16     (0x2 << RCC_CCIPR_I2C1SEL_SHIFT)    /* 10: HSI16 clock selected */

#define RCC_CCIPR_I2C3SEL_SHIFT       (16)    /* Bits 16-17: I2C3 clock source selection */
#define RCC_CCIPR_I2C3SEL_MASK        (0x3 << RCC_CCIPR_I2C3SEL_SHIFT)
#  define RCC_CCIPR_I2C3SEL_PCLK      (0x0 << RCC_CCIPR_I2C3SEL_SHIFT)    /* 00: PCLK selected */
#  define RCC_CCIPR_I2C3SEL_SYSCLK    (0x1 << RCC_CCIPR_I2C3SEL_SHIFT)    /* 01: System clock selected */
#  define RCC_CCIPR_I2C3SEL_HSI16     (0x2 << RCC_CCIPR_I2C3SEL_SHIFT)    /* 10: HSI16 clock selected */

#define RCC_CCIPR_LPTIM1SEL_SHIFT     (18)    /* Bits 18-19: LPTIM1 clock source selection */
#define RCC_CCIPR_LPTIM1SEL_MASK      (0x3 << RCC_CCIPR_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR_LPTIM1SEL_PCLK    (0x0 << RCC_CCIPR_LPTIM1SEL_SHIFT)  /* 00: PCLK selected */
#  define RCC_CCIPR_LPTIM1SEL_LSI     (0x1 << RCC_CCIPR_LPTIM1SEL_SHIFT)  /* 01: LSI clock selected */
#  define RCC_CCIPR_LPTIM1SEL_HSI16   (0x2 << RCC_CCIPR_LPTIM1SEL_SHIFT)  /* 10: HSI16 clock selected */
#  define RCC_CCIPR_LPTIM1SEL_LSE     (0x3 << RCC_CCIPR_LPTIM1SEL_SHIFT)  /* 11: LSE clock selected */

#define RCC_CCIPR_LPTIM2SEL_SHIFT     (20)    /* Bits 20-21: LPTIM2 clock source selection */
#define RCC_CCIPR_LPTIM2SEL_MASK      (0x3 << RCC_CCIPR_LPTIM2SEL_SHIFT)
#  define RCC_CCIPR_LPTIM2SEL_PCLK    (0x0 << RCC_CCIPR_LPTIM2SEL_SHIFT)  /* 00: PCLK selected */
#  define RCC_CCIPR_LPTIM2SEL_LSI     (0x1 << RCC_CCIPR_LPTIM2SEL_SHIFT)  /* 01: LSI clock selected */
#  define RCC_CCIPR_LPTIM2SEL_HSI16   (0x2 << RCC_CCIPR_LPTIM2SEL_SHIFT)  /* 10: HSI16 clock selected */
#  define RCC_CCIPR_LPTIM2SEL_LSE     (0x3 << RCC_CCIPR_LPTIM2SEL_SHIFT)  /* 11: LSE clock selected */

#define RCC_CCIPR_SAI1SEL_SHIFT       (22)    /* Bits 22-23: SAI1 clock source selection */
#define RCC_CCIPR_SAI1SEL_MASK        (0x3 << RCC_CCIPR_SAI1SEL_SHIFT)
#  define RCC_CCIPR_SAI1SEL_PLLSAI1   (0x0 << RCC_CCIPR_SAI1SEL_SHIFT)    /* 00: PLLSAI1 P clock selected */
#  define RCC_CCIPR_SAI1SEL_PLLP      (0x1 << RCC_CCIPR_SAI1SEL_SHIFT)    /* 01: PLL P clock selected */
#  define RCC_CCIPR_SAI1SEL_HSI16     (0x2 << RCC_CCIPR_SAI1SEL_SHIFT)    /* 10: HSI16 clock selected */
#  define RCC_CCIPR_SAI1SEL_EXTCLK    (0x3 << RCC_CCIPR_SAI1SEL_SHIFT)    /* 11: External input SAI1_EXTCLK */

#define RCC_CCIPR_CLK48SEL_SHIFT      (26)    /* Bits 26-27: 48 MHz clock source selection */
#define RCC_CCIPR_CLK48SEL_MASK       (0x3 << RCC_CCIPR_CLK48SEL_SHIFT)
#  define RCC_CCIPR_CLK48SEL_HSI48    (0x0 << RCC_CCIPR_CLK48SEL_SHIFT)   /* 00: HSI48 clock selected */
#  define RCC_CCIPR_CLK48SEL_PLLSAI1  (0x1 << RCC_CCIPR_CLK48SEL_SHIFT)   /* 01: PLLSAI1 Q clock selected */
#  define RCC_CCIPR_CLK48SEL_PLLMAIN  (0x2 << RCC_CCIPR_CLK48SEL_SHIFT)   /* 10: PLL Q clock selected */
#  define RCC_CCIPR_CLK48SEL_MSI      (0x3 << RCC_CCIPR_CLK48SEL_SHIFT)   /* 11: MSI clock selected */

#define RCC_CCIPR_ADCSEL_SHIFT        (28)    /* Bits 28-29: ADC clock source selection */
#define RCC_CCIPR_ADCSEL_MASK         (0x3 << RCC_CCIPR_ADCSEL_SHIFT)
#  define RCC_CCIPR_ADCSEL_NONE       (0x0 << RCC_CCIPR_ADCSEL_SHIFT)     /* 00: No clock */
#  define RCC_CCIPR_ADCSEL_PLLSAI1    (0x1 << RCC_CCIPR_ADCSEL_SHIFT)     /* 01: PLLSAI1 R clock selected */
#  define RCC_CCIPR_ADCSEL_PLLMAIN    (0x2 << RCC_CCIPR_ADCSEL_SHIFT)     /* 10: PLL P  clock selected */
#  define RCC_CCIPR_ADCSEL_SYSCLK     (0x3 << RCC_CCIPR_ADCSEL_SHIFT)     /* 11: System clock selected */

#define RCC_CCIPR_RNGSEL_SHIFT        (30)    /* Bits 30-31: RNG clock source selection */
#define RCC_CCIPR_RNGSEL_MASK         (0x3 << RCC_CCIPR_RNGSEL_SHIFT)
#  define RCC_CCIPR_RNGSEL_CLK48SEL   (0x0 << RCC_CCIPR_RNGSEL_SHIFT)    /* 00: Clock source selected by CLK48SEL */
#  define RCC_CCIPR_RNGSEL_LSI        (0x1 << RCC_CCIPR_RNGSEL_SHIFT)    /* 01: LSI clock selected */
#  define RCC_CCIPR_RNGSEL_LSE        (0x2 << RCC_CCIPR_RNGSEL_SHIFT)    /* 10: LSE clock selected */

/* Backup domain control register */

#define RCC_BDCR_LSEON              (1 << 0)  /* Bit 0: External Low Speed oscillator enable */
#define RCC_BDCR_LSERDY             (1 << 1)  /* Bit 1: External Low Speed oscillator Ready */
#define RCC_BDCR_LSEBYP             (1 << 2)  /* Bit 2: External Low Speed oscillator Bypass */

