onegray/nuttx/arch/arm/src/stm32wb/hardware/stm32wbx5xx_rcc.h
#define RCC_BDCR_LSEDRV_SHIFT       (3)       /* Bits 3-4: LSE oscillator drive capability */
#define RCC_BDCR_LSEDRV_MASK        (0x3 << RCC_BDCR_LSEDRV_SHIFT)
#  define RCC_BDCR_LSEDRV_LOW       (0x0 << RCC_BDCR_LSEDRV_SHIFT) /* 00: Lower driving capability */
#  define RCC_BDCR_LSEDRV_MEDLO     (0x1 << RCC_BDCR_LSEDRV_SHIFT) /* 01: Medium Low driving capability */
#  define RCC_BDCR_LSEDRV_MEDHI     (0x2 << RCC_BDCR_LSEDRV_SHIFT) /* 10: Medium High driving capability*/
#  define RCC_BDCR_LSEDRV_HIGH      (0x3 << RCC_BDCR_LSEDRV_SHIFT) /* 11: Higher driving capability */

#define RCC_BDCR_LSECSSON           (1 << 5)  /* Bit 5: CSS on LSE enable */
#define RCC_BDCR_LSECSSD            (1 << 6)  /* Bit 6: CSS on LSE failure Detection */

#define RCC_BDCR_RTCSEL_SHIFT       (8)       /* Bits 8-9: RTC clock source selection */
#define RCC_BDCR_RTCSEL_MASK        (0x3 << RCC_BDCR_RTCSEL_SHIFT)
#  define RCC_BDCR_RTCSEL_NOCLK     (0x0 << RCC_BDCR_RTCSEL_SHIFT) /* 00: No clock */
#  define RCC_BDCR_RTCSEL_LSE       (0x1 << RCC_BDCR_RTCSEL_SHIFT) /* 01: LSE oscillator clock used as RTC clock */
#  define RCC_BDCR_RTCSEL_LSI       (0x2 << RCC_BDCR_RTCSEL_SHIFT) /* 10: LSI oscillator clock used as RTC clock */
#  define RCC_BDCR_RTCSEL_HSE       (0x3 << RCC_BDCR_RTCSEL_SHIFT) /* 11: HSE oscillator clock divided by 32 used as RTC clock */

#define RCC_BDCR_RTCEN              (1 << 15) /* Bit 15: RTC clock enable */
#define RCC_BDCR_BDRST              (1 << 16) /* Bit 16: Backup domain software reset */
#define RCC_BDCR_LSCOEN             (1 << 24) /* Bit 24: Low speed clock output enable */
#define RCC_BDCR_LSCOSEL            (1 << 25) /* Bit 25: Low speed clock output selection */
#  define RCC_BCDR_LSCOSEL_LSI      (0)              /* LSI selected */
#  define RCC_BDCR_LSCOSEL_LSE      RCC_BDCR_LSCOSEL /* LSE selected */

/* Control/status register */

#define RCC_CSR_LSI1ON              (1 << 0)  /* Bit 0: LSI1 Internal Low Speed oscillator enable */
#define RCC_CSR_LSI1RDY             (1 << 1)  /* Bit 1: LSI1 Internal Low Speed oscillator Ready */
#define RCC_CSR_LSI2ON              (1 << 2)  /* Bit 2: LSI2 Internal Low Speed oscillator enable */
#define RCC_CSR_LSI2RDY             (1 << 3)  /* Bit 3: LSI2 Internal Low Speed oscillator Ready */

#define RCC_CSR_LSI2TRIM_SHIFT      (8)       /* Bits: 8-11: LSI2 oscillator trim */
#  define RCC_CSR_LSI2TRIM_MASK     (0x0f << RCC_CSR_LSI2TRIM_SHIFT)

#define RCC_CSR_RFWKPSEL_SHIFT      (14)      /* Bits: 14-15: RF system wakeup clock source selection */
#  define RCC_CSR_RFWKPSEL_MASK     (0x0f << RCC_CSR_RFWKPSEL_SHIFT)
#  define RCC_CSR_RFWKPSEL_NOCLK    (0x0 << RCC_CSR_RFWKPSEL_SHIFT) /* 00: No clock */
#  define RCC_CSR_RFWKPSEL_LSE      (0x1 << RCC_CSR_RFWKPSEL_SHIFT) /* 01: LSE used as RF wakeup clock */
#  define RCC_CSR_RFWKPSEL_HSE      (0x3 << RCC_CSR_RFWKPSEL_SHIFT) /* 11: HSE divided by 1024 used as RF clock */

#define RCC_CSR_RFRSTS              (1 << 16) /* Bit 16: Radio system BLE and 802.15.4 reset status */
#define RCC_CSR_RMVF                (1 << 23) /* Bit 23: Remove reset flag */
#define RCC_CSR_OBLRSTF             (1 << 25) /* Bit 25: Option byte loader reset flag */
#define RCC_CSR_PINRSTF             (1 << 26) /* Bit 26: PIN reset flag */
#define RCC_CSR_BORRSTF             (1 << 27) /* Bit 27: BOR reset flag */
#define RCC_CSR_SFTRSTF             (1 << 28) /* Bit 28: Software Reset flag */
#define RCC_CSR_IWWGRSTF            (1 << 29) /* Bit 29: Independent window watchdog reset flag */
#define RCC_CSR_WWDGRSTF            (1 << 30) /* Bit 30: Window watchdog reset flag */
#define RCC_CSR_LPWRRSTF            (1 << 31) /* Bit 31: Low-power reset flag */

/* Clock recovery RC register */

#define RCC_CRRCR_HSI48ON           (1 << 0)  /* Bit 0: HSI48 clock enable */
#define RCC_CRRCR_HSI48RDY          (1 << 1)  /* Bit 1: HSI48 clock ready flag */
#define RCC_CRRCR_HSI48CAL_SHIFT    (7)       /* Bits 7-15: HSI48 clock calibration */
#  define RCC_CRRCR_HSI48CAL_MASK   (0x01ff << RCC_CRRCR_HSI48CAL_SHIFT) /* HSI48 clock calibration */

/*  Clock HSE register */

#define RCC_HSECR_UNLOCKED          (1 << 0)  /* Bit 0: HSE clock control register unlocked */
#define RCC_HSECR_HSES              (1 << 3)  /* Bit 3: HSE sense amplifier threshold */
#  define RCC_HSECR_HSES_12         (0)       /* 0: HSE bias current factor 1/2 */
#  define RCC_HSECR_HSES_34         (1)       /* 1: HSE bias current factor 3/4 */

#define RCC_HSECR_HSEGMC_SHIFT      (4)       /* Bits 4-6: HSE current control */
#define RCC_HSECR_HSEGMC_MASK       (0x7 << RCC_HSECR_HSEGMC_SHIFT)
#  define RCC_HSECR_HSEGMC_018      (0x0 << RCC_HSECR_HSEGMC_SHIFT) /* 000: current max limit 0.18 mA/V */
#  define RCC_HSECR_HSEGMC_057      (0x1 << RCC_HSECR_HSEGMC_SHIFT) /* 001: current max limit 0.57 mA/V */
#  define RCC_HSECR_HSEGMC_078      (0x2 << RCC_HSECR_HSEGMC_SHIFT) /* 010: current max limit 0.78 mA/V */
#  define RCC_HSECR_HSEGMC_113      (0x3 << RCC_HSECR_HSEGMC_SHIFT) /* 011: current max limit 1.13 mA/V */
#  define RCC_HSECR_HSEGMC_061      (0x4 << RCC_HSECR_HSEGMC_SHIFT) /* 100: current max limit 0.61 mA/V */
#  define RCC_HSECR_HSEGMC_165      (0x5 << RCC_HSECR_HSEGMC_SHIFT) /* 101: current max limit 1.65 mA/V */
#  define RCC_HSECR_HSEGMC_212      (0x6 << RCC_HSECR_HSEGMC_SHIFT) /* 110: current max limit 2.12 mA/V */
#  define RCC_HSECR_HSEGMC_284      (0x7 << RCC_HSECR_HSEGMC_SHIFT) /* 111: current max limit 2.84 mA/V */

#define RCC_HSECR_HSETUNE_SHIFT     (8)       /* Bits 8-13: HSE capacitor tuning */
#define RCC_HSECR_HSETUNE_MASK      (0x7 << RCC_HSECR_HSETUNE_SHIFT)

/* Extended clock recovery register */

#define RCC_EXTCFGR_SHDHPRE_SHIFT   (0)       /* Bits: 0-3: HCLK4 shared prescaler (AHB4, FLASH, SRAM2) */
#define RCC_EXTCFGR_SHDHPRE_MASK    (0xf)
#  define RCC_EXTCFGR_SHDHPRE_1     (0x0 << RCC_EXTCFGR_SHDHPRE_SHIFT) /* 0000: SYSCLK not divided */
#  define RCC_EXTCFGR_SHDHPRE_3     (0x1 << RCC_EXTCFGR_SHDHPRE_SHIFT) /* 0001: SYSCLK divided by 3 */
#  define RCC_EXTCFGR_SHDHPRE_5     (0x2 << RCC_EXTCFGR_SHDHPRE_SHIFT) /* 0010: SYSCLK divided by 5 */
#  define RCC_EXTCFGR_SHDHPRE_6     (0x5 << RCC_EXTCFGR_SHDHPRE_SHIFT) /* 0101: SYSCLK divided by 6 */
#  define RCC_EXTCFGR_SHDHPRE_10    (0x6 << RCC_EXTCFGR_SHDHPRE_SHIFT) /* 0110: SYSCLK divided by 10 */
#  define RCC_EXTCFGR_SHDHPRE_32    (0x7 << RCC_EXTCFGR_SHDHPRE_SHIFT) /* 0111: SYSCLK divided by 32 */
#  define RCC_EXTCFGR_SHDHPRE_2     (0x8 << RCC_EXTCFGR_SHDHPRE_SHIFT) /* 1000: SYSCLK divided by 2 */
#  define RCC_EXTCFGR_SHDHPRE_4     (0x9 << RCC_EXTCFGR_SHDHPRE_SHIFT) /* 1001: SYSCLK divided by 4 */
#  define RCC_EXTCFGR_SHDHPRE_8     (0xa << RCC_EXTCFGR_SHDHPRE_SHIFT) /* 1010: SYSCLK divided by 8 */
#  define RCC_EXTCFGR_SHDHPRE_16    (0xb << RCC_EXTCFGR_SHDHPRE_SHIFT) /* 1011: SYSCLK divided by 16 */
#  define RCC_EXTCFGR_SHDHPRE_64    (0xc << RCC_EXTCFGR_SHDHPRE_SHIFT) /* 1100: SYSCLK divided by 64 */
#  define RCC_EXTCFGR_SHDHPRE_128   (0xd << RCC_EXTCFGR_SHDHPRE_SHIFT) /* 1101: SYSCLK divided by 128 */
#  define RCC_EXTCFGR_SHDHPRE_256   (0xe << RCC_EXTCFGR_SHDHPRE_SHIFT) /* 1110: SYSCLK divided by 256 */
#  define RCC_EXTCFGR_SHDHPRE_512   (0xf << RCC_EXTCFGR_SHDHPRE_SHIFT) /* 1111: SYSCLK divided by 512 */

