onegray/nuttx/arch/arm/src/stm32wb/hardware/stm32wbx5xx_rcc.h
#define RCC_EXTCFGR_C2HPRE_SHIFT    (0)       /* Bits: 4-7: CPU2 HCLK2 prescaler */
#define RCC_EXTCFGR_C2HPRE_MASK     (0xf)
#  define RCC_EXTCFGR_C2HPRE_1      (0x0 << RCC_EXTCFGR_C2HPRE_SHIFT) /* 0000: SYSCLK not divided */
#  define RCC_EXTCFGR_C2HPRE_3      (0x1 << RCC_EXTCFGR_C2HPRE_SHIFT) /* 0001: SYSCLK divided by 3 */
#  define RCC_EXTCFGR_C2HPRE_5      (0x2 << RCC_EXTCFGR_C2HPRE_SHIFT) /* 0010: SYSCLK divided by 5 */
#  define RCC_EXTCFGR_C2HPRE_6      (0x5 << RCC_EXTCFGR_C2HPRE_SHIFT) /* 0101: SYSCLK divided by 6 */
#  define RCC_EXTCFGR_C2HPRE_10     (0x6 << RCC_EXTCFGR_C2HPRE_SHIFT) /* 0110: SYSCLK divided by 10 */
#  define RCC_EXTCFGR_C2HPRE_32     (0x7 << RCC_EXTCFGR_C2HPRE_SHIFT) /* 0111: SYSCLK divided by 32 */
#  define RCC_EXTCFGR_C2HPRE_2      (0x8 << RCC_EXTCFGR_C2HPRE_SHIFT) /* 1000: SYSCLK divided by 2 */
#  define RCC_EXTCFGR_C2HPRE_4      (0x9 << RCC_EXTCFGR_C2HPRE_SHIFT) /* 1001: SYSCLK divided by 4 */
#  define RCC_EXTCFGR_C2HPRE_8      (0xa << RCC_EXTCFGR_C2HPRE_SHIFT) /* 1010: SYSCLK divided by 8 */
#  define RCC_EXTCFGR_C2HPRE_16     (0xb << RCC_EXTCFGR_C2HPRE_SHIFT) /* 1011: SYSCLK divided by 16 */
#  define RCC_EXTCFGR_C2HPRE_64     (0xc << RCC_EXTCFGR_C2HPRE_SHIFT) /* 1100: SYSCLK divided by 64 */
#  define RCC_EXTCFGR_C2HPRE_128    (0xd << RCC_EXTCFGR_C2HPRE_SHIFT) /* 1101: SYSCLK divided by 128 */
#  define RCC_EXTCFGR_C2HPRE_256    (0xe << RCC_EXTCFGR_C2HPRE_SHIFT) /* 1110: SYSCLK divided by 256 */
#  define RCC_EXTCFGR_C2HPRE_512    (0xf << RCC_EXTCFGR_C2HPRE_SHIFT) /* 1111: SYSCLK divided by 512 */

#define RCC_HSECR_SHDHPREF          (1 << 16)  /* Bit 16: HCLK4 shared prescaler flag (AHB4, FLASH, SRAM2) */
#define RCC_HSECR_C2HPREF           (1 << 17)  /* Bit 17: CPU2 HCLK2 prescaler flag */

#define RCC_HSECR_RFCSS             (1 << 20)  /* Bit 20: Radio system HCLK5 and APB3 selected clock */
#  define RCC_HSECR_RFCSS_HSI16     (0)        /* HSI16 used for Radio system HCLK5 and APB3 clock */
#  define RCC_HSECR_RFCSS_HSE2      (1)        /* HSE divided by 2 used for Radio system HCLK5 and APB3 clock */

#endif /* __ARCH_ARM_SRC_STM32WB_HARDWARE_STM32WB_RCC_H */
